Revit 2024 API
DocumentReloadingLatestEventArgs Class
 The event arguments used by the DocumentReloadingLatest event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class DocumentReloadingLatestEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class DocumentReloadingLatestEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class DocumentReloadingLatestEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadingLatestEventArgs
See Also
DocumentReloadingLatestEventArgs Members
Autodesk.Revit.DB.Events Namespace